Show / Hide Table of Contents
Class WeldData
Provides data of the single weld
Inheritance
System.Object
WeldData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class WeldData
Properties
Improve this Doc   View Source
ConnectedPartIds
Id of the weld
Declaration
public List<string> ConnectedPartIds { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.String>
Improve this Doc   View Source
End
End of the weld
Declaration
public Point3D End { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Id
Id of the weld
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Material
Name of the material
Declaration
public string Material { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
Name of the weld
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Start
Start of the weld
Declaration
public Point3D Start { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Thickness
Thickness of the weld
Declaration
public double Thickness { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WeldType
Type of the weld
Declaration
public WeldType WeldType { get; set; }
Property Value
 Type |  Description
 WeldType
 Improve this Doc
 View Source